In [2]:
import pandas as pd

### 1. ƒê·ªçc d·ªØ li·ªáu, d·ªØ li·ªáu c√≥ bao nhi√™u d√≤ng, c·ªôt v√† ki·ªÉu d·ªØ li·ªáu c·ªßa t·ª´ng thu·ªôc t√≠nh

In [55]:
df = pd.read_csv('Data/GDPlist.csv',decimal= ',', encoding= 'ISO-8859-1')
df

         Country      Continent  GDP (millions of US$)
0    Afghanistan           Asia                  18181
1        Albania         Europe                  12847
2        Algeria         Africa                 190709
3         Angola         Africa                 100948
4      Argentina  South America                 447644
..           ...            ...                    ...
120   Uzbekistan           Asia                  45353
121    Venezuela  South America                 315841
122      Vietnam           Asia                 122722
123        Yemen         Africa                  33675
124       Zambia         Africa                  19206

[125 rows x 3 columns]

In [56]:
print(f'D·ªØ li·ªáu c√≥ {df.shape[0]} d√≤ng')
print(f'D·ªØ li·ªáu c√≥ {df.shape[1]} c·ªôt')

D·ªØ li·ªáu c√≥ 125 d√≤ng
D·ªØ li·ªáu c√≥ 3 c·ªôt

In [57]:
df.dtypes

Country                  object
Continent                object
GDP (millions of US$)     int64
dtype: object

### 2. Vi·ªát h√≥a t√™n c√°c c·ªôt trong b·∫£ng d·ªØ li·ªáu: Country ü°™ Nuoc; Continent ü°™ Chauluc; GDP (millions of US ) ü°™ GDP (trieu)

In [58]:
df.rename(columns={'Country': 'Nuoc','Continent' :'Chauluc', 'GDP (millions of US$)' : 'GDP(trieu$)'}, inplace=True)
df.head()

          Nuoc        Chauluc  GDP(trieu$)
0  Afghanistan           Asia        18181
1      Albania         Europe        12847
2      Algeria         Africa       190709
3       Angola         Africa       100948
4    Argentina  South America       447644

### 3. Ch√®n th√™m m·ªôt c·ªôt ‚ÄúThanhpho‚Äù v√†o sau c·ªôt ‚ÄúNuoc‚Äù, gi√° tr·ªã ban ƒë·∫ßu l√† gi√° tr·ªã c·ªßa c·ªôt ‚ÄúNuoc‚Äù

In [59]:
df.insert(1,'Thanhpho', value = df.Nuoc )
df.head()

          Nuoc     Thanhpho        Chauluc  GDP(trieu$)
0  Afghanistan  Afghanistan           Asia        18181
1      Albania      Albania         Europe        12847
2      Algeria      Algeria         Africa       190709
3       Angola       Angola         Africa       100948
4    Argentina    Argentina  South America       447644

### 4. Trong c·ªôt Thanhpho, thay gi√° tr·ªã Vietnam th√†nh Hanoi; L√†m t∆∞∆°ng t·ª± v·ªõi c√°c n∆∞·ªõc c√≤n l·∫°i.

In [60]:
df.loc[df['Thanhpho'] == 'Vietnam', 'Thanhpho'] = 'Hanoi'
df.tail()

           Nuoc    Thanhpho        Chauluc  GDP(trieu$)
120  Uzbekistan  Uzbekistan           Asia        45353
121   Venezuela   Venezuela  South America       315841
122     Vietnam       Hanoi           Asia       122722
123       Yemen       Yemen         Africa        33675
124      Zambia      Zambia         Africa        19206

### 5. X√≥a c√°c b·∫£n ghi c√≥ Chauluc l√† ‚ÄòAsia‚Äô

In [61]:
df = df[df['Chauluc'] != 'Asia']
df[df['Chauluc'] == 'Asia']

Empty DataFrame
Columns: [Nuoc, Thanhpho, Chauluc, GDP(trieu$)]
Index: []

### 6. X√≥a c√°c b·∫£n ghi c√≥ GDP < 300000

In [62]:
df = df[df['GDP(trieu$)'] >= 300000]
df[df['GDP(trieu$)'] < 300000]

Empty DataFrame
Columns: [Nuoc, Thanhpho, Chauluc, GDP(trieu$)]
Index: []